lisp/clbe/clbe-23.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Further Reading</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Further Reading</h1>
<p>
Previous: <a href="clbe-22.html">22. Lambda Expressions</a>
</p>

<p>
Next: <a href="clbe-24.html">24. Appendix: Glossary</a>
</p>

<p>
We have come to the conclusion of this guide and I hope you found it
enjoyable and useful. There are quite a few topics that are not
covered in this guide, for example CLOS, the condition system and
the LOOP macro. Further details on these concepts and also other
concepts not covered in this guide can be found in the below
resources.
</p>

<p>
There is much more to learn in Lisp, our purpose today was simply to
help you get started in your journey. I really believe Lisp is a
beautiful and great language; I hope you do too.
</p>

<p>
Common Lisp the Language, 2nd Edition
<a href="http://www.cs.cmu.edu/Groups/AI/html/cltl/cltl2.html">http://www.cs.cmu.edu/Groups/AI/html/cltl/cltl2.html</a>
</p>

<p>
Common Lisp: A Gentle Introduction to Symbolic Computing
<a href="http://www.cs.cmu.edu/%7Edst/LispBook/">http://www.cs.cmu.edu/%7Edst/LispBook/</a>
</p>

<p>
Practical Common Lisp
<a href="http://www.gigamonkeys.com/book/">http://www.gigamonkeys.com/book/</a>
</p>

<p>
Common Lisp Cookbook
<a href="https://lispcookbook.github.io/cl-cookbook/">https://lispcookbook.github.io/cl-cookbook/</a>
</p>

<p>
Many More Resources (including links to various textbooks) are
available on Reddit
<a href="https://www.reddit.com/r/lisp/">https://www.reddit.com/r/lisp/</a>
</p>

<div id="outline-container-org9f08aaf" class="outline-2">
<h2 id="org9f08aaf">Contact Information</h2>
<div class="outline-text-2" id="text-org9f08aaf">
<p>
Feel free to contact me for any feedback or comments for this guide.
If you find it useful, do please star the github repo where it is
uploaded, this helps me track the guide’s value and also
increases its credibility in the eyes of others.
</p>

<p>
Repo (please star it!)
<a href="https://github.com/ashok-khanna/common-lisp-by-example">https://github.com/ashok-khanna/common-lisp-by-example</a>
</p>

<p>
My e-mail ashok.khanna@hotmail.com.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
